Documents/ПереоценкаТовараНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПереоценкаТовараНаКомиссии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаКомиссии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссионера</Name>
					<Comment>Сумма по к-рой товар передан на комиссию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПартии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ЦенаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупкиВБазВалюте</Name>
					<Comment>в долларах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПереоценкаТовараНаКомиссии/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	Если НастройкиЗагрузки.Количество() = 0 Тогда
		ЗаполнитьНастройкиЗагрузкиПоУмолчанию();
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры


#КонецОбласти 


#Область ДействияЭлементовФормы


#КонецОбласти 


#Область ДействияТабличнойЧасти

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	СписокПартий = ОстаткиПартий(ТекДанные.Серия);        
	КолвоПартий = СписокПартий.Количество();
	Если КолвоПартий = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ТекДанные.Серия + "!");
		Возврат;
	ИначеЕсли КолвоПартий > 1 Тогда
		Сигнал();
		ВыбратьВариант(СписокПартий);
	Иначе
		//ТекПартия = СписокПартий[0]; 
		ЗаполнитьРеквизитыПоСерии(ТекДанные, СписокПартий.Получить(0).Значение); 
	КонецЕсли;
	
КонецПроцедуры   
 
&НаКлиенте
Процедура ЗаполнитьРеквизитыПоСерии(СтрокаТЧ, СтруктураДанных)
	
	СтрокаТЧ.Номенклатура 	= СтруктураДанных.Номенклатура;
	СтрокаТЧ.Партия 		= СтруктураДанных.Партия;  
	СтрокаТЧ.Цена 			= СтруктураДанных.СуммаКомиссионера / СтруктураДанных.Количество;
	СтрокаТЧ.Количество 	= 1;
	
    ЗаполнитьСтарыеЦены();

КонецПроцедуры

&НаСервере
Функция ОстаткиПартий(Серия)
	
	спис = Новый СписокЗначений;
	ТаблицаПартий =	Комиссия.ОстаткиПартийНаКомиссии(Серия, Объект.Ссылка.МоментВремени(), Объект.Фирма, Объект.СкладКомиссии);
	Для каждого парт Из ТаблицаПартий Цикл
		СтруктураПартии = Новый Структура("Номенклатура,ИмяНоменклатуры,Партия,Количество,Сумма,СуммаКомиссионера");
		ЗаполнитьЗначенияСвойств(СтруктураПартии, парт);
		спис.Добавить(СтруктураПартии, парт.ИмяНоменклатуры);	
	КонецЦикла;	
    Возврат спис;
	
КонецФункции 

&НаКлиенте
Процедура ВыбратьВариант(СписокВариантов) Экспорт

	// Создаем описание оповещения. 
	// 1-й параметр: Имя процедуры, которая сработает после закрытия
	// 2-й параметр: Модуль, где находится эта процедура (ЭтаФорма)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораВарианта", ЭтаФорма);
	
	// Открываем форму. ОписаниеОповещения передается 7-м параметром  
	ПараметрыОткрытия = Новый Структура("Список, Заголовок", СписокВариантов, НСтр("ru = 'Выберите партию'; en = 'Select tha batch'"));
	ОткрытьФорму("ОбщаяФорма.ВыборПростогоВарианта", ПараметрыОткрытия, ЭтаФорма, , , , ОповещениеОЗакрытии);	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораВарианта(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ЗаполнитьРеквизитыПоСерии(Элементы.Товары.ТекущиеДанные, РезультатЗакрытия.ВыбранноеЗначение)
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти 


&НаСервере
Процедура ЗаполнитьСтарыеЦены()
	
	Соотв = Новый Соответствие;
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТоварыНаКомиссии.СуммаКомиссионераОстаток / ТоварыНаКомиссии.КоличествоОстаток КАК Цена,
	             |	ТоварыНаКомиссии.Партия КАК Партия
	             |ИЗ
	             |	РегистрНакопления.ТоварыНаКомиссии.Остатки(&Дата, Партия В (&Партии)) КАК ТоварыНаКомиссии";
	Запр.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), ТекущаяДатаСеанса()));
	Запр.УстановитьПараметр("Партии", объект.Товары.Выгрузить().ВыгрузитьКолонку("Партия"));	
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Партия, Выборка.Цена);
	КонецЦикла;
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		Цена = Соотв.Получить(СтрокаТЧ.Партия);	
		Если Цена = Неопределено Тогда
			СтрокаТЧ.ЦенаСтарая = 0;
		Иначе	
			СтрокаТЧ.ЦенаСтарая = Цена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#Область Команды
	
&НаКлиенте
Процедура ЗагрузитьИзЭкселя(Команда)
	
	Загрузка = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Загрузка.ПолноеИмяФайла = "";
    Загрузка.Фильтр = ("Файлы xlsx | *.xlsx");
    Загрузка.МножественныйВыбор = ложь;
    Загрузка.Заголовок = "Выберите файл";
    Оп = Новый ОписаниеОповещения("ЗавершениеВыбораФайла", ЭтаФорма);  
    Загрузка.Показать(Оп);

КонецПроцедуры   

&НаКлиенте
Процедура ЗавершениеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры)Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
        Если ВыбранныеФайлы.Количество() > 0 Тогда
            ИмяФайла = ВыбранныеФайлы[0];
            Ог = Новый ОписаниеОповещения("ЗавершениеЗагрузкиФайла", ЭтаФорма);
            НачатьПомещениеФайлаНаСервер(Ог,,,,ИмяФайла, УникальныйИдентификатор);
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершениеЗагрузкиФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры)Экспорт
    Если ОписаниеПомещенногоФайла <> Неопределено Тогда
        ИмпортВТабЧасть(ОписаниеПомещенногоФайла.Адрес);        
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИмпортВТабЧасть(АдресФайла)  
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресФайла) Тогда 
		Возврат;
	КонецЕсли;
	
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
    ИмяВремФайла = ПолучитьИмяВременногоФайла("xlsx");
    ДвоичныеДанные.Записать(ИмяВремФайла);
    табДок = Новый ТабличныйДокумент;
    
    Попытка
        табДок.Прочитать(ИмяВремФайла);
	Исключение
		Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	
    фЧитаем = Истина;
    СЧ = 2;
    Пока фЧитаем Цикл         
		
		Попытка
			СтрокаТЧ = Объект.Товары.Добавить(); 
			ПустаяСтрока = Истина;
			Для каждого Настр Из НастройкиЗагрузки Цикл
				АдресЯчейки = СтрШаблон("R%1C%2:R%1C%2", Формат(СЧ,"ЧГ="), Формат(Настр.НомерКолонки,"ЧГ="));
				ЗначЯчейки = Строка(табДок.ПолучитьОбласть(АдресЯчейки).ТекущаяОбласть.Текст); 
				Если ЗначениеЗаполнено(ЗначЯчейки) Тогда   
					ПустаяСтрока = Ложь;
					Если Настр.ЭтоЧисло Тогда
						СтрокаТЧ[Настр.ИмяПоля] = Число(СтрЗаменить(ЗначЯчейки," ",""));	
					Иначе	
						СтрокаТЧ[Настр.ИмяПоля] = ЗначЯчейки;	
					КонецЕсли; 
				КонецЕсли;  
			КонецЦикла;
			
			Если ПустаяСтрока Тогда
			    Объект.Товары.Удалить( Объект.Товары.Количество()-1);
				фЧитаем = Ложь;	
			КонецЕсли;
        Исключение
            Сообщение        = Новый СообщениеПользователю;
            Сообщение.Текст   = "Не удалось загрузить строку " + Строка(сч) + ОписаниеОшибки();
            Сообщение.Сообщить();
        КонецПопытки;
        СЧ = СЧ + 1; 
	КонецЦикла;
	
	Соотв = Новый Соответствие;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Серии", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Серия"));
	Запр.Текст = "ВЫБРАТЬ
	             |	Партии.Владелец КАК Номенклатура,
	             |	Партии.Серия КАК Серия,
	             |	Партии.Ссылка КАК Партия
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Серия В(&Серии)";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Серия, Новый Структура("Номенклатура,Партия", Выборка.Номенклатура, Выборка.Партия));
	КонецЦикла;  
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		ЗначенияСерии = Соотв.Получить(СтрокаТЧ.Серия);
		Если ЗначенияСерии <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЗначенияСерии);
		КонецЕсли;
	КонецЦикла;	
	
	ЗаполнитьСтарыеЦены();
	 
КонецПроцедуры

#КонецОбласти


#Область РаботаСоШтрихкодом

&НаКлиенте
Процедура ЛюбаяСерия(ШК, СтатьНаРучной = Ложь) 
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	//Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	//МоиИтоги(Объект.Товары.Количество()-1);
	Если НЕ ЗначениеЗаполнено(ШК) Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Новый СписокЗначений;  
	Если НЕ ЗначениеЗаполнено(Объект.СкладКомиссии) Тогда
		Ошибки.Добавить("Не выбран склад комиссии");
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Ошибки.Добавить("Не выбран контрагент");
	КонецЕсли; 
	Если Ошибки.Количество() > 0  Тогда
		Для каждого ош Из Ошибки Цикл
		    Сообщить(ош.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	СписокПартий = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.СкладКомиссии);
	
	КолвоПартий = СписокПартий.Количество();
	Если КолвоПартий = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ШК + "!");
		Возврат;
	ИначеЕсли КолвоПартий > 1 Тогда
		Сигнал();
		Эле = СписокПартий.ВыбратьЭлемент("Найдено несколько партий с такой серией, выберите:");
		Если Эле = Неопределено Тогда Возврат КонецЕсли;
		ТекПартия = Эле.Значение;
	Иначе
		ТекПартия = СписокПартий[0].Значение;
	КонецЕсли; 
	
	НовНоменклатура = гоРеквизит(ТекПартия, "Владелец");
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНоменклатура;
	НовСтр.Партия 		= ТекПартия;  
	НовСтр.Серия 		= гоРеквизит(ТекПартия, "Серия");
	НовСтр.ЦенаСтарая 	= гоРеквизит(ТекПартия, "ЦенаЗакупки");
	НовСтр.Количество 	= 1;
	
	//гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("ОжиданиеШК", 0.1, Истина);
	КонецЕсли;  
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеШК()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	//Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	//Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	//Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	//
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера();
	
	//если уже есть такой товар, зачем искать цену
	Если Объект.Товары.Количество() > 0 Тогда
		ЕстЦен = 0;
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНоменклатура));
		Если Мас.Количество() > 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры



#КонецОбласти     
#Область НастройкиЗагрузки
	
&НаКлиенте
Процедура НастройкиЗагрузкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗагрузкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиЗагрузкиПоУмолчанию()
	
	НастройкиЗагрузки.Очистить();
	Настр = НастройкиЗагрузки.Добавить();
	Настр.ИмяПоля = "Серия";
	Настр.НомерКолонки = 1;
	Настр = НастройкиЗагрузки.Добавить();
	Настр.ИмяПоля = "Количество";
	Настр.НомерКолонки = 2; 
	Настр.ЭтоЧисло = Истина;
	Настр = НастройкиЗагрузки.Добавить();
	Настр.ИмяПоля = "Цена";
	Настр.НомерКолонки = 3;
	Настр.ЭтоЧисло = Истина;
	
КонецПроцедуры

#КонецОбласти
